#include <iostream>
using namespace std;
/*
按照下述格式打印2016年1月日历：

Calendar 2016-01
--------------------------
Su  Mo  Tu  We  Th  Fr  Sa
--------------------------
                     1   2
 3   4   5   6   7   8   9
10  11  12  13  14  15  16
17  18  19  20  21  22  23
24  25  26  27  28  29  30
31
--------------------------

解题思路：
严格按格子来算，有 6 行 7列
其中，
1. 最开始为5 个空白，
2. 第6到36为数字，
3. 37到 42为空格
4. 数字为一位数需要填充两个空格
5. 每个空白为两个空格
*/
int main() {

	cout << "Calendar 2016-01" << endl;
	cout << "--------------------------" << endl;
	cout << "Su  Mo  Tu  We  Th  Fr  Sa" << endl;
	cout << "--------------------------" << endl;
	int i;
	for (i = 1; i <= 42; i++) {
		if(i < 6) {
			cout << "  ";
		} else if (i <= 14) {
			cout << " " << (i - 5);
		} else if (i <= 36) {
			cout <<(i - 5);
		} else {
			cout << "  ";
		}
		if (i % 7 == 0) {
			cout << endl;
		} else {
			cout << "  ";
		}

	}
	cout << "--------------------------" << endl;

    return 0;
}

/*
测试用例：


*/
